In [1]:
#Dependencies
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

from config import username
from config import password

In [3]:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/EmployeeSQL')
connection = engine.connect()

In [6]:
employees = pd.read_sql("SELECT * FROM employees", connection)
employees.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [7]:
salaries = pd.read_sql("SELECT * FROM salaries", connection)
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [8]:
combined = employees.merge(salaries, how = "outer", on = "emp_no")
combined.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date  salary
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28   40000
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07   53422
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21   48973
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26   40000
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18   40000

In [10]:
combined["salary"].min()

40000

In [11]:
combined["salary"].max()

129492

In [ ]:
bins = 30000, 50000, 70000, 90000, 110000, 130000
labels =